{"article-title": "Where’s the Reward?", "author": [{"author-name": "Shayan Doroudi"}, {"author-name": "Vincent Aleven"}, {"author-name": "Emma Brunskill"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "568", "pageEnd": "620", "publication-year": "2019", "keywords": ["Reinforcement learning", "Instructional sequencing", "Adaptive instruction", "History of artificial intelligence in education"], "citation": "Doroudi, S., Aleven, V. & Brunskill, E. Where’s the Reward?.\n                    Int J Artif Intell Educ 29, 568–620 (2019). https://doi.org/10.1007/s40593-019-00187-x", "abstract": "Since the 1960s, researchers have been trying to optimize the sequencing of instructional activities using the tools of reinforcement learning (RL) and sequential decision making under uncertainty. Many researchers have realized that reinforcement learning provides a natural framework for optimal instructional sequencing given a particular model of student learning, and excitement towards this area of research is as alive now as it was over fifty years ago. But does RL actually help students learn? If so, when and where might we expect it to be most helpful? To help answer these questions, we review the variety of attempts to use RL for instructional sequencing. First, we present a historical narrative of this research area. We identify three waves of research, which gives us a sense of the various communities of researchers that have been interested in this problem and where the field is going. Second, we review all of the empirical research that has compared RL-induced instructional policies to baseline methods of sequencing. We find that over half of the studies found that RL-induced policies significantly outperform baselines. Moreover, we identify five clusters of studies with different characteristics and varying levels of success in using RL to help students learn. We find that reinforcement learning has been most successful in cases where it has been constrained with ideas and theories from cognitive psychology and the learning sciences. However, given that our theories and models are limited, we also find that it has been useful to complement this approach with running more robust offline analyses that do not rely heavily on the assumptions of one particular model. Given that many researchers are turning to deep reinforcement learning and big data to tackle instructional sequencing, we believe keeping these best practices in mind can help guide the way to the reward in using RL for instructional sequencing."}