{"article-title": "Impact of an Artificial Intelligence Research Frame on the Perceived Credibility of Educational Research Evidence", "author": [{"author-name": "Mutlu Cukurova", "affiliation": "University College London", "address": "grid.83440.3b, 0000000121901201, UCL Knowledge Lab, University College London, 23- 29 Emerald Street, London, WC1N 3QS, UK"}, {"author-name": "Rosemary Luckin", "affiliation": "University College London", "address": "grid.83440.3b, 0000000121901201, UCL Knowledge Lab, University College London, 23- 29 Emerald Street, London, WC1N 3QS, UK"}, {"author-name": "Carmel Kent", "affiliation": "University College London", "address": "grid.83440.3b, 0000000121901201, UCL Knowledge Lab, University College London, 23- 29 Emerald Street, London, WC1N 3QS, UK"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume30", "pageStart": "205", "pageEnd": "235", "publication-year": "2020", "keywords": ["AI in Education", "Perceived credibility", "Research evidence", "The in-credible AI effect"], "citation": "Cukurova, M., Luckin, R. & Kent, C. Impact of an Artificial Intelligence Research Frame on the Perceived Credibility of Educational Research Evidence.\n                    Int J Artif Intell Educ 30, 205–235 (2020). https://doi.org/10.1007/s40593-019-00188-w", "abstract": "Artificial Intelligence (AI) is attracting a great deal of attention and it is important to investigate the public perceptions of AI and their impact on the perceived credibility of research evidence. In the literature, there is evidence that people overweight research evidence when framed in neuroscience findings. In this paper, we present the findings of the first investigation of the impact of an AI frame on the perceived credibility of educational research evidence. In an experimental study, we allocated 605 participants including educators to one of three conditions in which the same educational research evidence was framed within one of: AI, neuroscience, or educational psychology. The results demonstrate that when educational research evidence is framed within AI research, it is considered as less credible in comparison to when it is framed instead within neuroscience or educational psychology. The effect is still evident when the subjects’ familiarity with the framing discipline is controlled for. Furthermore, our results indicate that the general public perceives AI to be: less helpful in assisting us to understand how children learn, lacking in adherence to scientific methods, and to be less prestigious compared to neuroscience and educational psychology. Considering the increased use of AI technologies in Educational settings, we argue that there should be significant attempts to recover the public image of AI being less scientifically robust and less prestigious than educational psychology and neuroscience. We conclude the article suggesting that AI in Education community should attempt to be more actively engaged with key stakeholders of AI and Education to help mitigate such effects."}