{"article-title": "A Comparison of the Quality of Data-Driven Programming Hint Generation Algorithms", "author": [{"author-name": "Thomas W. Price", "affiliation": "North Carolina State University", "address": "0000 0001 2173 6074, grid.40803.3f, Department of Computer Science, North Carolina State University, Raleigh, NC, USA"}, {"author-name": "Yihuan Dong", "affiliation": "North Carolina State University", "address": "0000 0001 2173 6074, grid.40803.3f, Department of Computer Science, North Carolina State University, Raleigh, NC, USA"}, {"author-name": "Rui Zhi", "affiliation": "North Carolina State University", "address": "0000 0001 2173 6074, grid.40803.3f, Department of Computer Science, North Carolina State University, Raleigh, NC, USA"}, {"author-name": "Benjamin Paaßen", "affiliation": "Bielefeld University", "address": "0000 0001 0944 9128, grid.7491.b, CITEC Center of Excellence, Bielefeld University, Bielefeld, Germany"}, {"author-name": "Nicholas Lytle", "affiliation": "North Carolina State University", "address": "0000 0001 2173 6074, grid.40803.3f, Department of Computer Science, North Carolina State University, Raleigh, NC, USA"}, {"author-name": "Veronica Cateté", "affiliation": "North Carolina State University", "address": "0000 0001 2173 6074, grid.40803.3f, Department of Computer Science, North Carolina State University, Raleigh, NC, USA"}, {"author-name": "Tiffany Barnes", "affiliation": "North Carolina State University", "address": "0000 0001 2173 6074, grid.40803.3f, Department of Computer Science, North Carolina State University, Raleigh, NC, USA"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "368", "pageEnd": "395", "publication-year": "2019", "keywords": ["Data-driven hints", "Programming", "Intelligent tutoring systems", "Hint quality"], "citation": "Price, T.W., Dong, Y., Zhi, R. et al. A Comparison of the Quality of Data-Driven Programming Hint Generation Algorithms.\n                    Int J Artif Intell Educ 29, 368–395 (2019). https://doi.org/10.1007/s40593-019-00177-z", "abstract": "In the domain of programming, a growing number of algorithms automatically generate data-driven, next-step hints that suggest how students should edit their code to resolve errors and make progress. While these hints have the potential to improve learning if done well, few evaluations have directly assessed or compared the quality of different hint generation approaches. In this work, we present the QualityScore procedure, a novel method for automatically evaluating and comparing the quality of next-step programming hints using expert ratings. We first demonstrate that the automated QualityScore ratings agree with experts’ manual ratings. We then use the QualityScore procedure to compare the quality of six data-driven, next-step hint generation algorithms using two distinct programming datasets in two different programming languages. Our results show that there are large and significant differences between the quality of the six algorithms and that these differences are relatively consistent across datasets and problems. We also identify situations where the six algorithms struggle to produce high-quality hints, and we suggest ways that future work might address these challenges. We make our methods and data publicly available and encourage researchers to use the QualityScore procedure to evaluate additional algorithms and benchmark them against our results."}