{"article-title": "How Does Prior Knowledge Influence Eye Fixations and Sequences of Cognitive and Metacognitive SRL Processes during Learning with an Intelligent Tutoring System?", "author": [{"author-name": "Michelle Taub", "affiliation": "North Carolina State University", "address": "0000 0001 2173 6074, grid.40803.3f, Department of Psychology, North Carolina State University, 2310 Stinson Drive, Poe Hall, Raleigh, NC, 27695, USA"}, {"author-name": "Roger Azevedo", "affiliation": "North Carolina State University", "address": "0000 0001 2173 6074, grid.40803.3f, Department of Psychology, North Carolina State University, 2310 Stinson Drive, Poe Hall, Raleigh, NC, 27695, USA"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "1", "pageEnd": "28", "publication-year": "2019", "keywords": ["Intelligent tutoring systems", "Metacognition", "Multichannel data", "Prior knowledge", "Self-regulated learning"], "citation": "Taub, M., Azevedo, R. How Does Prior Knowledge Influence Eye Fixations and Sequences of Cognitive and Metacognitive SRL Processes during Learning with an Intelligent Tutoring System?.\n                    Int J Artif Intell Educ 29, 1–28 (2019). https://doi.org/10.1007/s40593-018-0165-4", "abstract": "The goal of this study was to use eye-tracking and log-file data to investigate the impact of prior knowledge on college students’ (N = 194, with a subset of n = 30 for eye tracking and sequence mining analyses) fixations on (i.e., looking at) self-regulated learning-related areas of interest (i.e., specific locations on the interface) and on the sequences of engaging in cognitive and metacognitive self-regulated learning processes during learning with MetaTutor, an Intelligent Tutoring System that teaches students about the human circulatory system. Results revealed that there were no significant differences in fixations on single areas of interest by the prior knowledge group students were assigned to; however there were significant differences in fixations on pairs of areas of interest, as evidenced by eye-tracking data. Furthermore, there were significant differences in sequential patterns of engaging in cognitive and metacognitive self-regulated learning processes by students’ prior knowledge group, as evidenced from log-file data. Specifically, students with high prior knowledge engaged in processes containing cognitive strategies and metacognitive strategies whereas students with low prior knowledge did not. These results have implications for designing adaptive intelligent tutoring systems that provide individualized scaffolding and feedback based on individual differences, such as levels of prior knowledge."}