{"article-title": "Determination of Professional Competencies Using an Alignment Algorithm of Academic Profiles and Job Advertisements, Based on Competence Thesauri and Similarity Measures", "author": [{"author-name": "Alexandra González-Eras"}, {"author-name": "Jose Aguilar"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "536", "pageEnd": "567", "publication-year": "2019", "keywords": ["Professional competencies", "Academic profiles", "Job advertisements", "Competence thesauri", "Similarity measures", "Alignment of profiles"], "citation": "González-Eras, A., Aguilar, J. Determination of Professional Competencies Using an Alignment Algorithm of Academic Profiles and Job Advertisements, Based on Competence Thesauri and Similarity Measures.\n                    Int J Artif Intell Educ 29, 536–567 (2019). https://doi.org/10.1007/s40593-019-00185-z", "abstract": "Describing the competencies required by a profession is essential for aligning online profiles of job seekers and job advertisements. Comparing the competencies described within each context has typically not be done, which has generated a complete disconnect in language between them. This work presents an approach for the alignment of online profiles and job advertisements, according to knowledge and skills, using measures of lexical, syntactic and taxonomic similarity. In addition, we use a ranking that allows the alignment of the profiles to the topics of a thesaurus that define competencies. The results are promising, because the combination of the measures of similarity with the alignment with thesauri of competencies offers robustness to the process of generation of professional competence descriptions. This combination allows dealing with the common problems of synonymy, homonymy, hypernymy/hyponymy and meronymy of the terms in Spanish. This research uses natural language processing to offer a novel approach for assessing the match of the competencies described by the applicants and by the employers, even if they use different terminology. The resulting approach, while developed in Spanish for computer science jobs, can be extended to other languages and domains, such is the case of recruitment, where it will contribute to the creation of better tools that give feedback to job seekers about how to best align their competencies with job opportunities."}