{"article-title": "Inferring Students’ Personality from Their Communication Behavior in Web-based Learning Systems", "author": [{"author-name": "Wen Wu", "affiliation": "Hong Kong Baptist University", "address": "0000 0004 1764 5980, grid.221309.b, Department of Computer Science, Hong Kong Baptist University, Hong Kong, China"}, {"author-name": "Li Chen", "affiliation": "Hong Kong Baptist University", "address": "0000 0004 1764 5980, grid.221309.b, Department of Computer Science, Hong Kong Baptist University, Hong Kong, China"}, {"author-name": "Qingchang Yang", "affiliation": "Hong Kong Baptist University", "address": "0000 0004 1764 5980, grid.221309.b, Adaptive Learning Center, Hong Kong Baptist University, Hong Kong, China"}, {"author-name": "You Li", "affiliation": "Jiachen Technology Limited", "address": "Jiachen Technology Limited, Hong Kong, China"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "189", "pageEnd": "216", "publication-year": "2019", "keywords": ["Web-based learning system", "Personality prediction", "Synchornous/asynchronous communication", "User survey", "Linguistic content"], "citation": "Wu, W., Chen, L., Yang, Q. et al. Inferring Students’ Personality from Their Communication Behavior in Web-based Learning Systems.\n                    Int J Artif Intell Educ 29, 189–216 (2019). https://doi.org/10.1007/s40593-018-00173-9", "abstract": "Communication tools have been popular in web-based learning systems because of their ability to promote the interaction and potentially alleviate the high dropout issue. In recent years, with the increased awareness among researchers about the individual difference of the students, more and more personalized learning supports have been developed. Although personality has been considered as a valuable personal factor being incorporated into the provision of personalized learning, existing studies mainly acquire students’ personality via questionnaires, which unavoidably demands user efforts. In this paper, we are motivated to derive students’ Big-Five personality from their communication behavior in web-based learning systems. Concretely, we first identify a set of features that are significantly influenced by students’ personality, which not only include their communication activities carried out in both synchronous and asynchronous web-based learning environment, but also their linguistic content in conversational texts. We then develop inference model to unify these features for determining students’ five personality traits, and find that students’ usage of different communication tools can be effective in predicting their Big-Five personality."}