{"article-title": "Effects of Voice-Based Synthetic Assistant on Performance of Emergency Care Provider in Training", "author": [{"author-name": "Praveen Damacharla"}, {"author-name": "Parashar Dhakal"}, {"author-name": "Sebastian Stumbo"}, {"author-name": "Ahmad Y. Javaid"}, {"author-name": "Subhashini Ganapathy"}, {"author-name": "David A. Malek"}, {"author-name": "Douglas C. Hodge"}, {"author-name": "Vijay Devabhaktuni"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "122", "pageEnd": "143", "publication-year": "2019", "keywords": ["Emergency care provider", "Empirical study", "Human performance", "Performance analysis", "Personal assistant", "Synthetic assistant"], "citation": "Damacharla, P., Dhakal, P., Stumbo, S. et al. Effects of Voice-Based Synthetic Assistant on Performance of Emergency Care Provider in Training.\n                    Int J Artif Intell Educ 29, 122–143 (2019). https://doi.org/10.1007/s40593-018-0166-3", "abstract": "As part of a perennial project, our team is actively engaged in developing new synthetic assistant (SA) technologies to assist in training combat medics and medical first responders. It is critical that medical first responders are well trained to deal with emergencies more effectively. This would require real-time monitoring and feedback for each trainee. Therefore, we introduced a voice-based SA to augment the training process of medical first responders and enhance their performance in the field. The potential benefits of SAs include a reduction in training costs and enhanced monitoring mechanisms. Despite the increased usage of voice-based personal assistants (PAs) in day-to-day life, the associated effects are commonly neglected for a study of human factors. Therefore, this paper focuses on performance analysis of the developed voice-based SA in emergency care provider training for a selected emergency treatment scenario. The research discussed in this paper follows design science in developing proposed technology; at length, we discussed architecture and development and presented working results of voice-based SA. The empirical testing was conducted on two groups as user studies using statistical analysis tools, one trained with conventional methods and the other with the help of SA. The statistical results demonstrated the amplification in training efficacy and performance of medical responders powered by SA. Furthermore, the paper also discusses the accuracy and time of task execution (t) and concludes with the guidelines for resolving the identified problems."}