{"article-title": "Adding Communicative and Affective Strategies to an Embodied Conversational Agent to Enhance Second Language Learners’ Willingness to Communicate", "author": [{"author-name": "Emmanuel Ayedoun", "affiliation": "Osaka Prefecture University", "address": "0000 0001 0676 0594, grid.261455.1, Graduate School of Humanities and Sustainable System Sciences, Osaka Prefecture University, Sakai, Japan"}, {"author-name": "Yuki Hayashi", "affiliation": "Osaka Prefecture University", "address": "0000 0001 0676 0594, grid.261455.1, Graduate School of Humanities and Sustainable System Sciences, Osaka Prefecture University, Sakai, Japan"}, {"author-name": "Kazuhisa Seta", "affiliation": "Osaka Prefecture University", "address": "0000 0001 0676 0594, grid.261455.1, Graduate School of Humanities and Sustainable System Sciences, Osaka Prefecture University, Sakai, Japan"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "29", "pageEnd": "57", "publication-year": "2019", "keywords": ["Willingness to communicate in L2", "Embodied conversational agents", "Communication strategies", "Affective backchannels"], "citation": "Ayedoun, E., Hayashi, Y. & Seta, K. Adding Communicative and Affective Strategies to an Embodied Conversational Agent to Enhance Second Language Learners’ Willingness to Communicate.\n                    Int J Artif Intell Educ 29, 29–57 (2019). https://doi.org/10.1007/s40593-018-0171-6", "abstract": "This paper describes an embodied conversational agent enhanced with specific conversational strategies aiming to foster learners’ readiness towards communication in a second language (L2). Willingness to communicate (WTC) in a second language is believed to have a direct and sustained influence on learners’ actual usage frequency of the target language. To help overcome the lack of suitable environments for increasing L2 learners’ WTC, our approach is to build embodied conversational agents that can help learners surmount their apprehension towards communication in L2. Here, we focus on the dialogue management aspects of our approach and propose a model based on a set of communication strategies (CS) and affective backchannels (AB) to foster such agents’ ability to carry on natural and WTC-friendly conversations with learners. We examined learners’ expected WTC after interacting with one of the following versions of the system: an agent featuring both CS and AB; an agent featuring only CS; and an agent featuring only AB. The results suggested that combining CS and AB empowers the conversational agent and leads to higher expected WTC among L2 learners. We also found that even the AB-only version of the system had the potential to enhance WTC to some extent. These findings are evidence of the feasibility of enhancing L2 learners’ engagement towards communication using a computer-based environment coupled with appropriate conversational strategies."}