{"article-title": "Instructing a Teachable Agent with Low or High Self-Efficacy – Does Similarity Attract?", "author": [{"author-name": "Betty Tärning"}, {"author-name": "Annika Silvervarg"}, {"author-name": "Agneta Gulz"}, {"author-name": "Magnus Haake"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "89", "pageEnd": "121", "publication-year": "2019", "keywords": ["Self-efficacy", "Teachable agent", "Similarity attraction", "Math game", "Educational technology"], "citation": "Tärning, B., Silvervarg, A., Gulz, A. et al. Instructing a Teachable Agent with Low or High Self-Efficacy – Does Similarity Attract?.\n                    Int J Artif Intell Educ 29, 89–121 (2019). https://doi.org/10.1007/s40593-018-0167-2", "abstract": "This study examines the effects of teachable agents’ expressed self-efficacy on students. A total of 166 students, 10- to 11-years-old, used a teachable agent-based math game focusing on the base-ten number system. By means of data logging and questionnaires, the study compared the effects of high vs. low agent self-efficacy on the students’ in-game performance, their own math self-efficacy, and their attitude towards their agent. The study further explored the effects of matching vs. mismatching between student and agent with respect to self-efficacy. Overall, students who interacted with an agent with low self-efficacy performed better than students interacting with an agent with high self-efficacy. This was especially apparent for students who had reported low self-efficacy themselves, who performed on par with students with high self-efficacy when interacting with a digital tutee with low self-efficacy. Furthermore, students with low self-efficacy significantly increased their self-efficacy in the matched condition, i.e. when instructing a teachable agent with low self-efficacy. They also increased their self-efficacy when instructing a teachable agent with high self-efficacy, but to a smaller extent and not significantly. For students with high self-efficacy, a potential corresponding effect on a self-efficacy change due to matching may be hidden behind a ceiling effect. As a preliminary conclusion, on the basis of the results of this study, we propose that teachable agents should preferably be designed to have low self-efficacy."}