{"article-title": "Evaluation of Parsons Problems with Menu-Based Self-Explanation Prompts in a Mobile Python Tutor", "author": [{"author-name": "Geela Venise Firmalo Fabic", "affiliation": "University of Canterbury", "address": "grid.21006.35, 0000 0001 2179 1970, Department of Computer Science and Software Engineering, University of Canterbury, Christchurch, New Zealand"}, {"author-name": "Antonija Mitrovic", "affiliation": "University of Canterbury", "address": "grid.21006.35, 0000 0001 2179 1970, Department of Computer Science and Software Engineering, University of Canterbury, Christchurch, New Zealand"}, {"author-name": "Kourosh Neshatian", "affiliation": "University of Canterbury", "address": "grid.21006.35, 0000 0001 2179 1970, Department of Computer Science and Software Engineering, University of Canterbury, Christchurch, New Zealand"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "507", "pageEnd": "535", "publication-year": "2019", "keywords": ["Mobile Python tutor", "Menu-based self-explanation", "Parsons problems"], "citation": "Fabic, G.V.F., Mitrovic, A. & Neshatian, K. Evaluation of Parsons Problems with Menu-Based Self-Explanation Prompts in a Mobile Python Tutor.\n                    Int J Artif Intell Educ 29, 507–535 (2019). https://doi.org/10.1007/s40593-019-00184-0", "abstract": "The overarching goal of our project is to design effective learning activities for PyKinetic, a smartphone Python tutor. In this paper, we present a study using a variant of Parsons problems we designed for PyKinetic. Parsons problems contain randomized code which needs to be re-ordered to produce the desired effect. In our variant of Parsons problems, students were asked to complete the missing part(s) of some lines of code (LOCs), and rearrange the LOCs to match the problem description. In addition, we added menu-based Self-Explanation (SE) prompts. Students were asked to self-explain concepts related to incomplete LOCs they solved. Our hypotheses were: (H1) PyKinetic would be successful in supporting learning; (H2) menu-based SE prompts would result in further learning benefits; (H3) students with low prior knowledge (LP) would learn more from our Parsons problems in comparison to those with high prior knowledge (HP). We found that the participants’ scores on the post-test improved, thus showing evidence of learning in PyKinetic. The experimental group participants, who had SE prompts, showed improved learning in comparison to the control group. Further analyses revealed that LP students improved more than HP students and the improvement is even more pronounced for LP learners who self-explained. The contributions of our work are a) pedagogically-guided design of Parsons problems with SE prompts used on smartphones, b) showing that our Parsons problems are effective in supporting learning and c) our Parsons problems with SE prompts are especially effective for students with low prior knowledge."}