{"article-title": "Incorporating Features Learned by an Enhanced Deep Knowledge Tracing Model for STEM/Non-STEM Job Prediction", "author": [{"author-name": "Chun-Kit Yeung", "affiliation": "Find Solution Ai Limited", "address": "Find Solution Ai Limited, Sai Ying Pun, Hong Kong"}, {"author-name": "Dit-Yan Yeung", "affiliation": "Hong Kong University of Science and Technology", "address": "0000 0004 1937 1450, grid.24515.37, Hong Kong University of Science and Technology, Kowloon, Hong Kong"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "317", "pageEnd": "341", "publication-year": "2019", "keywords": ["Educational data mining", "Career prediction", "Knowledge tracing", "Machine learning"], "citation": "Yeung, C., Yeung, D. Incorporating Features Learned by an Enhanced Deep Knowledge Tracing Model for STEM/Non-STEM Job Prediction.\n                    Int J Artif Intell Educ 29, 317–341 (2019). https://doi.org/10.1007/s40593-019-00175-1", "abstract": "The 2017 ASSISTments Data Mining competition aims to use data from a longitudinal study for predicting a brand-new outcome of students which had never been studied before by the educational data mining research community. Specifically, it facilitates research in developing predictive models that predict whether the first job of a student out of college belongs to a STEM (the acronym for science, technology, engineering, and mathematics) field. This is based on the student’s learning history on the ASSISTments blended learning platform in the form of extensive clickstream data gathered during the middle school years. To tackle this challenge, we first estimate the expected knowledge state of students with respect to different mathematical skills using a deep knowledge tracing (DKT) model and an enhanced DKT (DKT+) model. We then combine the features corresponding to the DKT/DKT+ expected knowledge state with other features extracted directly from the student profile in the dataset to train several machine learning models for the STEM/non-STEM job prediction. Our experiments show that models trained with the combined features generally perform better than the models trained with the student profile alone. Detailed analysis on the student’s knowledge state reveals that, when compared with non-STEM students, STEM students generally show a higher mastery level and a higher learning gain in mathematics."}