{"article-title": "The Impact of Contextualized Emotions on Self-Regulated Learning and Scientific Reasoning during Learning with a Game-Based Learning Environment", "author": [{"author-name": "Michelle Taub", "affiliation": "University of Central Florida", "address": "grid.170430.1, 0000 0001 2159 2859, Department of Learning Sciences and Educational Research, University of Central Florida, 12494 University Blvd., Orlando, FL, 32816, USA"}, {"author-name": "Robert Sawyer", "affiliation": "North Carolina State University", "address": "grid.40803.3f, 0000 0001 2173 6074, Department of Computer Science, North Carolina State University, 890 Oval Drive, Raleigh, NC, 27606, USA"}, {"author-name": "James Lester", "affiliation": "North Carolina State University", "address": "grid.40803.3f, 0000 0001 2173 6074, Department of Computer Science, North Carolina State University, 890 Oval Drive, Raleigh, NC, 27606, USA"}, {"author-name": "Roger Azevedo", "affiliation": "University of Central Florida", "address": "grid.170430.1, 0000 0001 2159 2859, Department of Learning Sciences and Educational Research, University of Central Florida, 12494 University Blvd., Orlando, FL, 32816, USA"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume30", "pageStart": "97", "pageEnd": "120", "publication-year": "2020", "keywords": ["Context", "Facial expressions of emotions", "Game-based learning", "Scientific reasoning", "Self-regulated learning"], "citation": "Taub, M., Sawyer, R., Lester, J. et al. The Impact of Contextualized Emotions on Self-Regulated Learning and Scientific Reasoning during Learning with a Game-Based Learning Environment.\n                    Int J Artif Intell Educ 30, 97–120 (2020). https://doi.org/10.1007/s40593-019-00191-1", "abstract": "The goal of this study was to examine college students’ (n = 61) contextualized emotions during in-game actions while playing Crystal Island, a game-based learning environment where students are tasked with solving the mystery of what illness impacted all island inhabitants. We examined emotions during in-game actions: during book reading, after scanning food items for the transmission source, and after submitting a final diagnosis. We dichotomized each activity’s feedback into a positive or negative outcome: a relevant or irrelevant book for solving the mystery, testing food items that generate a positive or negative result, or submitting a correct or incorrect final diagnosis. Results revealed that expressing joy while reading a relevant book and expressing confusion after a positive scan significantly positively predicted overall game score, which we used as a proxy for problem-solving performance. Implications include understanding different levels of emotions students express during learning with all advanced learning technologies."}