{"article-title": "Automated Analysis of Reflection in Writing: Validating Machine Learning Approaches", "author": [{"author-name": "Thomas Daniel Ullmann", "affiliation": "The Open University", "address": "0000000096069301, grid.10837.3d, Institute of Educational Technology, The Open University, Walton Hall, Milton Keynes, MK7 6AA, UK"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "217", "pageEnd": "257", "publication-year": "2019", "keywords": ["Assessment and testing of learning outcomes", "Automated content analysis", "Educational data mining", "Learning analytics", "Machine learning", "Modeling metacognitive skills", "Reflection", "Reflective writing", "Text analysis"], "citation": "Ullmann, T.D. Automated Analysis of Reflection in Writing: Validating Machine Learning Approaches.\n                    Int J Artif Intell Educ 29, 217–257 (2019). https://doi.org/10.1007/s40593-019-00174-2", "abstract": "Reflective writing is an important educational practice to train reflective thinking. Currently, researchers must manually analyze these writings, limiting practice and research because the analysis is time and resource consuming. This study evaluates whether machine learning can be used to automate this manual analysis. The study investigates eight categories that are often used in models to assess reflective writing, and the evaluation is based on 76 student essays (5080 sentences) that are largely from third- and second-year health, business, and engineering students. To test the automated analysis of reflection in writings, machine learning models were built based on a random sample of 80% of the sentences. These models were then tested on the remaining 20% of the sentences. Overall, the standardized evaluation shows that five out of eight categories can be detected automatically with substantial or almost perfect reliability, while the other three categories can be detected with moderate reliability (Cohen’s κ ranges between .53 and .85). The accuracies of the automated analysis were on average 10% lower than the accuracies of the manual analysis. These findings enable reflection analytics that is immediate and scalable."}