{"article-title": "Predicting the Difficulty of Exercise Items for Dynamic Difficulty Adaptation in Adaptive Language Tutoring", "author": [{"author-name": "Irina Pandarova"}, {"author-name": "Torben Schmidt"}, {"author-name": "Johannes Hartig"}, {"author-name": "Ahcène Boubekki"}, {"author-name": "Roger Dale Jones"}, {"author-name": "Ulf Brefeld"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "342", "pageEnd": "367", "publication-year": "2019", "keywords": ["Adaptivity", "Intelligent language tutoring systems", "Item difficulty prediction", "Item response theory", "Machine learning", "Second language acquisition"], "citation": "Pandarova, I., Schmidt, T., Hartig, J. et al. Predicting the Difficulty of Exercise Items for Dynamic Difficulty Adaptation in Adaptive Language Tutoring.\n                    Int J Artif Intell Educ 29, 342–367 (2019). https://doi.org/10.1007/s40593-019-00180-4", "abstract": "Advances in computer technology and artificial intelligence create opportunities for developing adaptive language learning technologies which are sensitive to individual learner characteristics. This paper focuses on one form of adaptivity in which the difficulty of learning content is dynamically adjusted to the learner’s evolving language ability. A pilot study is presented which aims to advance the (semi-)automatic difficulty scoring of grammar exercise items to be used in dynamic difficulty adaptation in an intelligent language tutoring system for practicing English tenses. In it, methods from item response theory and machine learning are combined with linguistic item analysis in order to calibrate the difficulty of an initial exercise pool of cued gap-filling items (CGFIs) and isolate CGFI features predictive of item difficulty. Multiple item features at the gap, context and CGFI levels are tested and relevant predictors are identified at all three levels. Our pilot regression models reach encouraging prediction accuracy levels which could, pending additional validation, enable the dynamic selection of newly generated items ranging from moderately easy to moderately difficult. The paper highlights further applications of the proposed methodology in the area of adapting language tutoring, item design and second language acquisition, and sketches out issues for future research."}