{"article-title": "Problematizing Helps! A Classroom Study of Computer-Based Guidance for Invention Activities", "author": [{"author-name": "Catherine C. Chase", "affiliation": "Columbia University", "address": "0000000419368729, grid.21729.3f, Teachers College, Columbia University, 525 W. 120th St., New York, NY, 10027, USA"}, {"author-name": "Helena Connolly", "affiliation": "Columbia University", "address": "0000000419368729, grid.21729.3f, Teachers College, Columbia University, 525 W. 120th St., New York, NY, 10027, USA"}, {"author-name": "Marianna Lamnina", "affiliation": "Columbia University", "address": "0000000419368729, grid.21729.3f, Teachers College, Columbia University, 525 W. 120th St., New York, NY, 10027, USA"}, {"author-name": "Vincent Aleven", "affiliation": "Carnegie Mellon University", "address": "0000 0001 2097 0344, grid.147455.6, Carnegie Mellon University, 5000 Forbes Ave., Pittsburgh, PA, 15213, USA"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "283", "pageEnd": "316", "publication-year": "2019", "keywords": ["Invention", "Exploratory learning environments", "Scaffolding", "STEM learning", "Adaptive technologies", "Productive failure"], "citation": "Chase, C.C., Connolly, H., Lamnina, M. et al. Problematizing Helps! A Classroom Study of Computer-Based Guidance for Invention Activities.\n                    Int J Artif Intell Educ 29, 283–316 (2019). https://doi.org/10.1007/s40593-019-00178-y", "abstract": "A successful instructional method is to engage learners with exploratory problem-solving before providing explanations of the canonical solutions and foundational concepts. A key question is whether and what type of guidance will lead learners to explore more productively and how this guidance will affect subsequent learning and transfer. We investigate this question through the design and study of the Invention Coach, an adaptive, computer-based learning environment that problematizes students’ understanding as they invent fundamental physics equations. Problematizing guidance (Reiser Journal of the Learning Sciences, 13(3), 273–304, 2004), which encourages learners to grapple with domain complexity, is well-suited to the goals of Invention. However, there are few examples of technology-based learning environments that were explicitly designed to problematize and scant research on their efficacy. In an experimental study, 199 middle schoolers worked with either motivational, task + motivational, or problematizing + task + motivational guidance versions of the Coach while inventing. Students who engaged with the problematizing Coach were better able to transfer their knowledge to novel domains in the short term, and their transfer gains were comparable to those provoked by human tutors. While students in the problematizing condition were less likely to invent the correct solutions, they engaged in more targeted and efficient exploration of the solution space and were less likely to report experiences of difficulty. Findings suggest that problematizing guidance has the potential to effectively support exploratory problem-solving, when the goal is to facilitate productive exploration and transfer from subsequent instruction. The work also has implications for the design of problematizing guidance."}