{"article-title": "Active Learning is About More Than Hands-On: A Mixed-Reality AI System to Support STEM Education", "author": [{"author-name": "Nesra Yannier", "affiliation": "Carnegie Mellon University", "address": "grid.147455.6, 0000 0001 2097 0344, Human Computer Interaction Institute and Psychology Department, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA, 15213, USA"}, {"author-name": "Scott E. Hudson", "affiliation": "Carnegie Mellon University", "address": "grid.147455.6, 0000 0001 2097 0344, Human Computer Interaction Institute and Psychology Department, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA, 15213, USA"}, {"author-name": "Kenneth R. Koedinger", "affiliation": "Carnegie Mellon University", "address": "grid.147455.6, 0000 0001 2097 0344, Human Computer Interaction Institute and Psychology Department, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA, 15213, USA"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume30", "pageStart": "74", "pageEnd": "96", "publication-year": "2020", "keywords": ["Educational technology", "Learning sciences", "Early STEM (Science", "Technology", "Engineering and Math) Education", "Artificial intelligence", "Mixed-reality"], "citation": "Yannier, N., Hudson, S.E. & Koedinger, K.R. Active Learning is About More Than Hands-On: A Mixed-Reality AI System to Support STEM Education.\n                    Int J Artif Intell Educ 30, 74–96 (2020). https://doi.org/10.1007/s40593-020-00194-3", "abstract": "Along with substantial consensus around the power of active learning, comes some lack of precision in what its essential ingredients are. New educational technologies offer vehicles for systematically exploring benefits of alternative techniques for supporting active learning. We introduce a new genre of Intelligent Science Station technology that uses Artificial Intelligence (AI) to support children in learning science by doing science in the real world. We use this system in a randomized controlled trial that investigates whether active learning is best when it is implemented as guided deliberate practice, as constructive “hands-on” activity, or as a combination of both. Automated, reactive guidance is made possible by a specialized AI computer vision algorithm we developed to track what children are doing in the physical environment as they do experiments and discoveries with physical objects. The results support deliberate practice and indicate that having some guided discovery based on effective learning mechanism such as self-explanation, contrasting cases and personalized interactive feedback produces more robust learning compared to exploratory construction alone. Children learning through guided discovery achieve greater understanding of the scientific principles than children learning through hands-on construction alone (4 times more pre-to-post test improvement). Importantly, a combined guided discovery and hands-on construction condition leads to better learning of the very hands-on construction skills that are the sole focus of the hands-on constructive learning condition (>10 times more pre-to-post improvement). These results suggest ways to achieve powerful active learning of science and engineering that go beyond the widespread temptation to equate hands-on activity with effective learning."}