{"article-title": "Personalizing Algebra to Students’ Individual Interests in an Intelligent Tutoring System: Moderators of Impact", "author": [{"author-name": "Candace Walkington", "affiliation": "Southern Methodist University", "address": "0000 0004 1936 7929, grid.263864.d, Southern Methodist University, 3101 University Blvd., Ste. 345, Dallas, TX, 75025, USA"}, {"author-name": "Matthew L. Bernacki", "affiliation": "University of Nevada, Las Vegas", "address": "0000 0001 0806 6926, grid.272362.0, University of Nevada, Las Vegas, 4505 S. Maryland Parkway, Las Vegas, NV, 89154-3003, USA"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "58", "pageEnd": "88", "publication-year": "2019", "keywords": ["Personalization", "Personalized learning", "Individual interest", "Intelligent tutoring systems"], "citation": "Walkington, C., Bernacki, M.L. Personalizing Algebra to Students’ Individual Interests in an Intelligent Tutoring System: Moderators of Impact.\n                    Int J Artif Intell Educ 29, 58–88 (2019). https://doi.org/10.1007/s40593-018-0168-1", "abstract": "Students experience mathematics in their day-to-day lives as they pursue their individual interests in areas like sports or video games. The present study explores how connecting to students’ individual interests can be used to personalize learning using an Intelligent Tutoring System (ITS) for algebra. We examine the idea that the effects of personalization may be moderated by students’ depth of quantitative engagement with their out-of-school interests. We also examine whether math problems designed to draw upon students’ knowledge of their individual interests at a deep level (i.e., actual quantitative experiences) or surface level (i.e., superficial changes to problem topic) have differential effects. Results suggest that connecting math instruction to students’ out-of-school interests can be beneficial for learning in an ITS and reduces gaming the system. However, benefits may only be realized when students’ degree of quantitative engagement with their out-of-school interests matches the depth at which the personalized problems are written. Students whose quantitative engagement with their interests is minimal may benefit most when problems draw upon superficial aspects of their interest areas. Students who report significant quantitative engagement with their interests may benefit most when individual interests are deeply incorporated into the quantitative structure of math problems. We also find that problems with deeper personalization may spur positive affective states and ward off negative ones for all students. Findings suggest depth is a critical feature of personalized learning with implications for theory and AI instructional design."}