{"article-title": "Are MOOC Learning Analytics Results Trustworthy? With Fake Learners, They Might Not Be!", "author": [{"author-name": "Giora Alexandron", "affiliation": "Weizmann Institute of Science", "address": "grid.13992.30, 0000 0004 0604 7563, Weizmann Institute of Science, Rehovot, Israel"}, {"author-name": "Lisa Y. Yoo", "affiliation": "Massachusetts Institute of Technology", "address": "grid.116068.8, 0000 0001 2341 2786, Massachusetts Institute of Technology, Cambridge, MA, USA"}, {"author-name": "José A. Ruipérez-Valiente", "affiliation": "Massachusetts Institute of Technology", "address": "grid.116068.8, 0000 0001 2341 2786, Massachusetts Institute of Technology, Cambridge, MA, USA"}, {"author-name": "Sunbok Lee", "affiliation": "University of Houston", "address": "grid.266436.3, 0000 0004 1569 9707, University of Houston, Houston, TX, USA"}, {"author-name": "David E. Pritchard", "affiliation": "Massachusetts Institute of Technology", "address": "grid.116068.8, 0000 0001 2341 2786, Massachusetts Institute of Technology, Cambridge, MA, USA"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "484", "pageEnd": "506", "publication-year": "2019", "keywords": ["Learning Analytics", "MOOCs", "Replication research", "Sensitivity analysis", "Fake learners"], "citation": "Alexandron, G., Yoo, L.Y., Ruipérez-Valiente, J.A. et al. Are MOOC Learning Analytics Results Trustworthy? With Fake Learners, They Might Not Be!.\n                    Int J Artif Intell Educ 29, 484–506 (2019). https://doi.org/10.1007/s40593-019-00183-1", "abstract": "The rich data that Massive Open Online Courses (MOOCs) platforms collect on the behavior of millions of users provide a unique opportunity to study human learning and to develop data-driven methods that can address the needs of individual learners. This type of research falls into the emerging field of learning analytics. However, learning analytics research tends to ignore the issue of the reliability of results that are based on MOOCs data, which is typically noisy and generated by a largely anonymous crowd of learners. This paper provides evidence that learning analytics in MOOCs can be significantly biased by users who abuse the anonymity and open-nature of MOOCs, for example by setting up multiple accounts, due to their amount and aberrant behavior. We identify these users, denoted fake learners, using dedicated algorithms. The methodology for measuring the bias caused by fake learners’ activity combines the ideas of Replication Research and Sensitivity Analysis. We replicate two highly-cited learning analytics studies with and without fake learners data, and compare the results. While in one study, the results were relatively stable against fake learners, in the other, removing the fake learners’ data significantly changed the results. These findings raise concerns regarding the reliability of learning analytics in MOOCs, and highlight the need to develop more robust, generalizable and verifiable research methods."}