{"article-title": "The Effect of Metacognitive Scaffolding for Learning by Teaching a Teachable Agent", "author": [{"author-name": "Noboru Matsuda", "affiliation": "North Carolina State University", "address": "grid.40803.3f, 0000 0001 2173 6074, Department of Computer Science, North Carolina State University, 890 Oval Dr., Raleigh, NC, 27606, USA"}, {"author-name": "Wenting Weng", "affiliation": "Texas A&M University", "address": "grid.264756.4, 0000 0004 4687 2082, Department of Educational Psychology, Texas A&M University, 540 Ross Street, College Station, TX, 77843, USA"}, {"author-name": "Natalie Wall", "affiliation": "Texas A&M University", "address": "grid.264756.4, 0000 0004 4687 2082, Department of Teaching, Learning and Culture, Texas A&M University, 540 Ross Street, College Station, TX, 77843, USA"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume30", "pageStart": "1", "pageEnd": "37", "publication-year": "2020", "keywords": ["Learning by teaching", "Goal-oriented practice", "Teachable agent", "Algebra"], "citation": "Matsuda, N., Weng, W. & Wall, N. The Effect of Metacognitive Scaffolding for Learning by Teaching a Teachable Agent.\n                    Int J Artif Intell Educ 30, 1–37 (2020). https://doi.org/10.1007/s40593-019-00190-2", "abstract": "The effect of metacognitive scaffolding for learning by teaching was investigated and compared against learning by being tutored. Three versions of an online learning environment for learning algebra equations were created: (1) APLUS that allows students to interactively teach a synthetic peer with a goal to have the synthetic peer pass the quiz while the system provides students with metacognitive scaffolding on how to teach. (2) AplusTutor that provides cognitive tutoring (i.e., immediate feedback and just-in-time hint) and metacognitive scaffolding on how to learn. And, (3) CogTutor+ that provides traditional cognitive tutoring on mastery learning. Two school studies were conducted with a total of 444 6th through 8th grade students. 208 students completed the study and were included in the analysis. The results show that (i) students’ proficiency in solving equations increased after using our interventions for 4 days, but there was no difference in the effectiveness across three interventions, and (ii) learning by teaching with metacognitive scaffolding facilitated learning equally across various levels of students’ prior competency."}