{"article-title": "Investigating the Effect of Agency on Learning from Worked Examples, Erroneous Examples and Problem Solving", "author": [{"author-name": "Xingliang Chen", "affiliation": "University of Canterbury", "address": "0000 0001 2179 1970, grid.21006.35, Intelligent Computer Tutoring Group, Department of Computer Science and Software Engineering, University of Canterbury, Christchurch, New Zealand"}, {"author-name": "Antonija Mitrovic", "affiliation": "University of Canterbury", "address": "0000 0001 2179 1970, grid.21006.35, Intelligent Computer Tutoring Group, Department of Computer Science and Software Engineering, University of Canterbury, Christchurch, New Zealand"}, {"author-name": "Moffat Mathews", "affiliation": "University of Canterbury", "address": "0000 0001 2179 1970, grid.21006.35, Intelligent Computer Tutoring Group, Department of Computer Science and Software Engineering, University of Canterbury, Christchurch, New Zealand"}], "journal-title": "International Journal of Artificial Intelligence in Education", "journal-volume": "volume29", "pageStart": "396", "pageEnd": "424", "publication-year": "2019", "keywords": ["Problem solving", "Worked examples", "Erroneous examples", "Adaptive selection of learning activities", "Agency", "Intelligent tutoring systems"], "citation": "Chen, X., Mitrovic, A. & Mathews, M. Investigating the Effect of Agency on Learning from Worked Examples, Erroneous Examples and Problem Solving.\n                    Int J Artif Intell Educ 29, 396–424 (2019). https://doi.org/10.1007/s40593-019-00179-x", "abstract": "Agency refers to the level of control the student has over learning. Most studies on agency in computer-based learning environments have been conducted in the context of educational games and multimedia learning, while there is little research done in the context of learning with Intelligent Tutoring Systems (ITSs). We conducted a study in the context of SQL-Tutor, an ITS that teaches database querying, with students solving a fixed set of ten problems. Before each problem, students worked on a preparatory task, which could be presented as a worked example, erroneous example, or another isomorphic problem. There were two conditions in the study. In the High-Agency condition, students could select the type of preparatory task freely or skip it altogether. In the Low-Agency condition, an adaptive strategy selected preparatory tasks for students on the basis of their performance. The participants were classified as High Prior Knowledge (HPK) or Low Prior Knowledge (LPK), based on their scores on the pre-test. Due to the timing of the study, we had 40 participants who completed all elements of the study. The participants in both Low- and High-Agency conditions improved significantly from the pre- to post-test, and there was no difference between the LPK and HPK students on post-test scores. Therefore, we have not found an effect of agency on learning. The Low Agency condition was beneficial for both HPK and LPK students, while in the High Agency condition there was significant improvement between the pre- and post-test only for the LPK students. In the High-Agency group, the HPK students selected more challenging learning activities, but did not outperform LPK students on the post-test scores. The limitation of our study is the small sample size."}